docs/evidence/perf/sweep-pool-10.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m05.0s), 05/55 VUs, 0 complete and 0 interrupted iterations
warmup    [   1% ] 5 VUs    00.1s/20s
measure • [   0% ] waiting  24.9s

running (0m06.0s), 05/55 VUs, 40 complete and 0 interrupted iterations
warmup    [   5% ] 5 VUs    01.1s/20s
measure • [   0% ] waiting  23.9s

running (0m07.0s), 05/55 VUs, 80 complete and 0 interrupted iterations
warmup    [  10% ] 5 VUs    02.1s/20s
measure • [   0% ] waiting  22.9s

running (0m08.0s), 05/55 VUs, 120 complete and 0 interrupted iterations
warmup    [  15% ] 5 VUs    03.1s/20s
measure • [   0% ] waiting  21.9s

running (0m09.0s), 05/55 VUs, 160 complete and 0 interrupted iterations
warmup    [  21% ] 5 VUs    04.1s/20s
measure • [   0% ] waiting  20.9s

running (0m10.0s), 05/55 VUs, 205 complete and 0 interrupted iterations
warmup    [  25% ] 5 VUs    05.1s/20s
measure • [   0% ] waiting  19.9s

running (0m11.0s), 05/55 VUs, 245 complete and 0 interrupted iterations
warmup    [  30% ] 5 VUs    06.1s/20s
measure • [   0% ] waiting  18.9s

running (0m12.0s), 05/55 VUs, 285 complete and 0 interrupted iterations
warmup    [  35% ] 5 VUs    07.1s/20s
measure • [   0% ] waiting  17.9s

running (0m13.0s), 05/55 VUs, 330 complete and 0 interrupted iterations
warmup    [  40% ] 5 VUs    08.1s/20s
measure • [   0% ] waiting  16.9s

running (0m14.0s), 05/55 VUs, 370 complete and 0 interrupted iterations
warmup    [  46% ] 5 VUs    09.1s/20s
measure • [   0% ] waiting  15.9s

running (0m15.0s), 05/55 VUs, 415 complete and 0 interrupted iterations
warmup    [  50% ] 5 VUs    10.1s/20s
measure • [   0% ] waiting  14.9s

running (0m16.0s), 05/55 VUs, 455 complete and 0 interrupted iterations
warmup    [  55% ] 5 VUs    11.1s/20s
measure • [   0% ] waiting  13.9s

running (0m17.0s), 05/55 VUs, 500 complete and 0 interrupted iterations
warmup    [  60% ] 5 VUs    12.1s/20s
measure • [   0% ] waiting  12.9s

running (0m18.0s), 05/55 VUs, 545 complete and 0 interrupted iterations
warmup    [  65% ] 5 VUs    13.1s/20s
measure • [   0% ] waiting  11.9s

running (0m19.0s), 05/55 VUs, 590 complete and 0 interrupted iterations
warmup    [  70% ] 5 VUs    14.1s/20s
measure • [   0% ] waiting  10.9s

running (0m20.0s), 05/55 VUs, 630 complete and 0 interrupted iterations
warmup    [  75% ] 5 VUs    15.1s/20s
measure • [   0% ] waiting  09.9s

running (0m21.0s), 05/55 VUs, 675 complete and 0 interrupted iterations
warmup    [  80% ] 5 VUs    16.1s/20s
measure • [   0% ] waiting  08.9s

running (0m22.0s), 05/55 VUs, 715 complete and 0 interrupted iterations
warmup    [  86% ] 5 VUs    17.1s/20s
measure • [   0% ] waiting  07.9s

running (0m23.0s), 05/55 VUs, 760 complete and 0 interrupted iterations
warmup    [  90% ] 5 VUs    18.1s/20s
measure • [   0% ] waiting  06.9s

running (0m24.0s), 05/55 VUs, 805 complete and 0 interrupted iterations
warmup    [  95% ] 5 VUs    19.1s/20s
measure • [   0% ] waiting  05.9s

running (0m25.0s), 00/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.9s

running (0m26.0s), 00/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.9s

running (0m27.0s), 00/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.9s

running (0m28.0s), 00/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.9s

running (0m29.0s), 00/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.9s

running (0m30.0s), 50/55 VUs, 850 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   0% ] 50 VUs  00.1s/45s

running (0m31.0s), 50/55 VUs, 1296 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   2% ] 50 VUs  01.1s/45s

running (0m32.0s), 50/55 VUs, 1755 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   5% ] 50 VUs  02.1s/45s

running (0m33.0s), 50/55 VUs, 2251 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   7% ] 50 VUs  03.1s/45s

running (0m34.0s), 50/55 VUs, 2610 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   9% ] 50 VUs  04.1s/45s

running (0m35.0s), 50/55 VUs, 2899 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  11% ] 50 VUs  05.1s/45s

running (0m36.0s), 50/55 VUs, 3376 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  14% ] 50 VUs  06.1s/45s

running (0m37.0s), 50/55 VUs, 3854 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  16% ] 50 VUs  07.1s/45s

running (0m38.0s), 50/55 VUs, 4326 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  18% ] 50 VUs  08.1s/45s

running (0m39.0s), 50/55 VUs, 4776 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  20% ] 50 VUs  09.1s/45s

running (0m40.0s), 50/55 VUs, 5226 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  22% ] 50 VUs  10.1s/45s

running (0m41.0s), 50/55 VUs, 5706 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  25% ] 50 VUs  11.1s/45s

running (0m42.0s), 50/55 VUs, 6176 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  27% ] 50 VUs  12.1s/45s

running (0m43.0s), 50/55 VUs, 6626 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  29% ] 50 VUs  13.1s/45s

running (0m44.0s), 50/55 VUs, 7076 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  31% ] 50 VUs  14.1s/45s

running (0m45.0s), 50/55 VUs, 7526 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  34% ] 50 VUs  15.1s/45s

running (0m46.0s), 50/55 VUs, 7976 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  36% ] 50 VUs  16.1s/45s

running (0m47.0s), 50/55 VUs, 8439 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  38% ] 50 VUs  17.1s/45s

running (0m48.0s), 50/55 VUs, 8926 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  40% ] 50 VUs  18.1s/45s

running (0m49.0s), 50/55 VUs, 9376 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  42% ] 50 VUs  19.1s/45s

running (0m50.0s), 50/55 VUs, 9826 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  45% ] 50 VUs  20.1s/45s

running (0m51.0s), 50/55 VUs, 10279 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  47% ] 50 VUs  21.1s/45s

running (0m52.0s), 50/55 VUs, 10776 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  49% ] 50 VUs  22.1s/45s

running (0m53.0s), 50/55 VUs, 11226 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  51% ] 50 VUs  23.1s/45s

running (0m54.0s), 50/55 VUs, 11676 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  54% ] 50 VUs  24.1s/45s

running (0m55.0s), 50/55 VUs, 12126 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  56% ] 50 VUs  25.1s/45s

running (0m56.0s), 50/55 VUs, 12587 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  58% ] 50 VUs  26.1s/45s

running (0m57.0s), 50/55 VUs, 13076 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  60% ] 50 VUs  27.1s/45s

running (0m58.0s), 50/55 VUs, 13526 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  62% ] 50 VUs  28.1s/45s

running (0m59.0s), 50/55 VUs, 13976 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  65% ] 50 VUs  29.1s/45s

running (1m00.0s), 50/55 VUs, 14438 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  67% ] 50 VUs  30.1s/45s

running (1m01.0s), 50/55 VUs, 14926 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  69% ] 50 VUs  31.1s/45s

running (1m02.0s), 50/55 VUs, 15356 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  71% ] 50 VUs  32.1s/45s

running (1m03.0s), 50/55 VUs, 15826 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  74% ] 50 VUs  33.1s/45s

running (1m04.0s), 50/55 VUs, 16276 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  76% ] 50 VUs  34.1s/45s

running (1m05.0s), 50/55 VUs, 16726 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  78% ] 50 VUs  35.1s/45s

running (1m06.0s), 50/55 VUs, 17176 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  80% ] 50 VUs  36.1s/45s

running (1m07.0s), 50/55 VUs, 17659 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  82% ] 50 VUs  37.1s/45s

running (1m08.0s), 50/55 VUs, 18126 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  85% ] 50 VUs  38.1s/45s

running (1m09.0s), 50/55 VUs, 18576 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  87% ] 50 VUs  39.1s/45s

running (1m10.0s), 50/55 VUs, 19026 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  89% ] 50 VUs  40.1s/45s

running (1m11.0s), 50/55 VUs, 19498 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  91% ] 50 VUs  41.1s/45s

running (1m12.0s), 50/55 VUs, 19976 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  94% ] 50 VUs  42.1s/45s

running (1m13.0s), 50/55 VUs, 20426 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  96% ] 50 VUs  43.1s/45s

running (1m14.0s), 50/55 VUs, 20876 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  98% ] 50 VUs  44.1s/45s

running (1m15.0s), 00/55 VUs, 21376 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=99.99%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=4.67ms

    http_req_failed{phase:measure}
    ✓ 'rate<0.01' rate=0.49%


  █ TOTAL RESULTS 

    checks_total.......: 171008 2280.365541/s
    checks_succeeded...: 99.99% 171007 out of 171008
    checks_failed......: 0.00%  1 out of 171008

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✗ order 처리됨
      ↳  99% — ✓ 21375 / ✗ 1

    CUSTOM
    resp_2xx.......................: 85199 1136.115642/s
    resp_409_conflict..............: 404   5.387278/s
    resp_5xx.......................: 1     0.013335/s
    resp_error_coded...............: 405   5.400613/s
    setup_requests.................: 100   1.333485/s

    HTTP
    http_req_duration..............: avg=2.38ms   min=181.91µs med=1.52ms   p(95)=4.99ms   p(99)=12.98ms  max=273.63ms
      { expected_response:true }...: avg=2.37ms   min=181.91µs med=1.52ms   p(95)=4.99ms   p(99)=12.98ms  max=273.63ms
      { phase:measure }............: avg=2.26ms   min=181.91µs med=1.48ms   p(95)=4.67ms   p(99)=11.69ms  max=273.63ms
    http_req_failed................: 0.47% 405 out of 85604
      { phase:measure }............: 0.49% 405 out of 82104
    http_reqs......................: 85604 1141.516255/s

    EXECUTION
    iteration_duration.............: avg=110.13ms min=101.99ms med=107.65ms p(95)=117.82ms p(99)=142.59ms max=651.07ms
    iterations.....................: 21376 285.045693/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 88 MB 1.2 MB/s
    data_sent......................: 18 MB 242 kB/s



running (1m15.0s), 00/55 VUs, 21376 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s